/*
Navicat MySQL Data Transfer

Source Server         : Connection1
Source Server Version : 50717
Source Host           : localhost:3306
Source Database       : film_shiguang

Target Server Type    : MYSQL
Target Server Version : 50717
File Encoding         : 65001

Date: 2017-06-02 11:32:10
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for film_comment
-- ----------------------------
DROP TABLE IF EXISTS `film_comment`;
CREATE TABLE `film_comment` (
  `id` int(11) NOT NULL,
  `fid` int(255) DEFAULT NULL,
  `date` varchar(255) DEFAULT NULL,
  `content` text,
  `location` varchar(255) DEFAULT NULL,
  `nickname` varchar(255) DEFAULT NULL,
  `rating` int(255) DEFAULT NULL,
  `reply_count` int(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of film_comment
-- ----------------------------
INSERT INTO `film_comment` VALUES ('7899498', '218219', '1432465740', '\n\r\n 最近看了不少动画电影，国内的《兔侠传奇》，国外的《疯狂外星人》等等。昨天又有幸提前观影了《潜艇总动员：时光宝盒》这部完全是幼儿型的动画电影。其实很明白如果看多了好莱坞的动画电影，再看国产电影的话确实有些惨不忍睹。不过对于这部《潜艇总动员》，我可能小时候也没看过这么幼稚的动画片。\n\r\n 傻瓜式的剧情加上有些粗糙的动画造型，80分钟的《潜艇总动员》对于一个成年人的我来说确实显得有些漫长了。...', '', 'wengod', '0', '5');
INSERT INTO `film_comment` VALUES ('7970456', '40205', '1469603040', '　　等了许久，《神奇女侠》和《正义联盟》的第一款预告片终于到来了。虽然期间也刷了好几遍《自杀小队》预告片和BVS剪辑版，DC电影宇宙明年2部巨作比我想象中的还要好。从风格上来说，一定会有人说扎克似乎意识到过于黑暗风是无法被大众市场接受，没有段子和笑料作为润滑剂是很难保持电影的整体趣味。诚然适当的幽默段子能够满足普通人的口味，调节电影节奏。与BVS那种凝重高冷的风格不同，单是预告片的对比，蝙蝠侠也是...', '', '念及己名', '0', '31');
INSERT INTO `film_comment` VALUES ('7993966', '232932', '1485162720', '《摔跤吧！爸爸》恐怕是2016年以来最让我失望的影片了，事实上我从2015年就开始期待它，直到2017年初，才得以欣赏它。\n \n都说，期望越大，失望越大。\n \n这话不假。\n \n\n《摔跤吧！爸爸》\n \n...', '', '绯色_神仙', '8', '252');
INSERT INTO `film_comment` VALUES ('8001008', '231651', '1490884140', '\n\n回到新片《异类觉醒》，该片由瑞典导演：丹尼尔·伊斯皮诺萨执导，故事则由去年大热的漫威电影《死侍》的两位编剧操刀。虽然同样是【空间站、人类与未知生命体】。但是这里探讨更多的，是人类与未知生命的相遇过程，以及接下来展开的，一些列关于生存的“竞赛”。\n', '', '小玄儿', '8', '15');
INSERT INTO `film_comment` VALUES ('8002528', '224149', '1492172340', '绝不吝惜炸药，慢镜头与手持镜头很多，却空有场面，节奏与惊险感都很差，想象力更是严重下降。强行洗白肖家兄弟能让韩与吉赛尔从棺材里坐起来。扁平的塞隆反派，还不如海伦米伦的肖家老母令人印象深刻。', '', 'Mosquito史歌', '6', '55');
INSERT INTO `film_comment` VALUES ('8004549', '216008', '1493950080', '\n　　如果你关注了第一部《银河护卫队》，或者不断令人费解地探寻詹姆斯 古恩的超级神秘彩蛋，你应该知道詹姆斯古恩是漫威电影宇宙中藏彩蛋大师，喜欢在他的《银护》电影中藏各种致敬和内部玩笑。\n\n　　古恩和扎克施耐德都有着对于展示他们是漫威迷弟或者DC迷弟的热情，而且一点不令人惊讶古恩的令人期待，令人悲喜交加的续集会致敬漫威宇宙（或者广大漫威文化）。\n \n　　本片会联系到整体漫威宇宙，预...', '', '逍遥侠客121', '7', '24');
INSERT INTO `film_comment` VALUES ('8006487', '224894', '1495599300', '对于中国历史上第一次反侵略战争——抗倭之战的呈现，陈嘉上处理的客观而又热血，严肃又不失诙谐，用了足足129分钟，为中国观众打造了一个能文善武、骁勇无畏的民族英雄戚继光。', '', '蓝骨和尚', '0', '6');
INSERT INTO `film_comment` VALUES ('8006655', '151657', '1495725420', '\n\n   三十年河东，三十年河西，套用在曾经创下票房奇迹的《加勒比海盗》(Pirates of the Caribbean)身上，实在再合适不过了。在经历了狗尾续貂、整个跑偏的第四集《加勒比海盗：惊涛怪浪》(Pirates of the Caribbean: On Stranger Tides)以后，这个系列的第五集这次终于再度回到了逗比和猫鼠游戏式的正轨...', '', 'Action', '0', '23');
INSERT INTO `film_comment` VALUES ('8006688', '219109', '1495764960', '\n《“吃吃”的爱》是一部为小S量定制的搞笑喜剧电影，其中不乏许多励志的桥段。在这部影片中，小S再度展现了蔡康永的鬼马想像力，她在片中不仅是双人设的女主，还穿越双重时间和串联双CP线。\n对比以往的电影，《“吃吃”的爱》和同期档作品完全不一样。女主角有两种性格一冷一热，两面人生。在太空，她是面馆的老板；在地球，她是一个18线的演员。这部影片把上官娣娣的人生作为描写重点，能看出来导演有三个用意：首先，增...', '', '杜娟的博客', '9', '1');
INSERT INTO `film_comment` VALUES ('8006777', '218413', '1495817640', '\r\n\r\n\r\n《银河守卫队》基于著名游戏系列《瑞奇与叮当》改编，有意识地试图削弱并戏谑其故事与人物本身非常传统的类型化元素。影片中充斥着许多标注不同外星星球地名的字幕，然后又以卑鄙反派照例必有的一场将其邪恶计划详细信息全盘托出的演讲对这些字幕予以了补充说明。\n\r\n当然，我们还看到了一段菜鸟受训的蒙太奇，不过在此之前，台词已经告知了我们，这场戏马上上演。在这个场景中，非传统英雄形象的男主角得以测试所有...', '', '革角力', '0', '4');
INSERT INTO `film_comment` VALUES ('8006913', '244048', '1495909500', '\r\n\r\n\r\n\r\n老实说，我对《三只小猪与神灯》印象不佳，但记忆深刻，因为那次是我少有的在电影院睡着的观影经历之一。在我印象中，《三只小猪与神灯》基本上就是一部猪猪侠版《喜羊羊与灰太狼》大电影，不仅几只小猪的父母和喜羊羊的爸妈一样是放心子女成为留守儿童的冒险科学家，而且小狼崽与几位主角的关系也同样若即若离，还有最后反派都要说一句“我还会回来的！”\n\r\n不过在续集《三只小猪2》中，狼王并没有回来，这次...', '', '革角力', '0', '2');
INSERT INTO `film_comment` VALUES ('8006914', '244238', '1495914300', '其实这部电影，也不能说是一部毫无价值的烂片，却一定好不到哪里去。如果有人去看了这部电影之后大呼坑爹，说欺骗感情，我也是不会感到奇怪的。所谓“《洛克王国》系列动画制作团队打造”的说法，顶多能糊弄一下不明真相的吃瓜孩童和家长，想骗过所有人？Just forget it！', '', '光之守护-西亚斯-小光', '4', '1');
INSERT INTO `film_comment` VALUES ('8006926', '232256', '1495925580', '何止动作戏！黄子韬《夏天19岁的肖像》依旧可圈可点\n\n5月27日上映的电影《夏天19岁的肖像》是一部青春、爱情、悬疑片。爆爱机车的19岁少年康乔，在一次骑车放飞自我的过程中，突遭意外而受伤入院。闲来无聊的他，在目光投向窗外的时候，无意间收获到了自己生命中的女神。接下来的日子里，康乔更借来望远镜，天天偷窥他心中的那个她，并出乎意料的拍下了她的秘密。而这，恰恰决定了他俩日后的命运走向和归宿。\n\n作为...', '', '丑鱼尼莫789', '8', '1');
INSERT INTO `film_comment` VALUES ('8006957', '221226', '1495943040', '无论是怎样的职业，什么样的角色，只要在前面加上“临时”二字，总有种事先被注入一剂安慰剂的感觉：不满意？有瑕疵？忍一忍嘛，退一步海阔天空，何况还是个临时的，没有较劲的必要。由钱江汉、黄志伟执导的励志爱情喜剧《临时演员》却打破惯性思维，敢于反其道而行，演绎了一出“临时演员”凭借自己的真诚与努力不断成就自己，最终成为人生赢家的励志故事。\n\n正值演艺事业上升期的女明星梁丹妮一路走来也算是顺风顺水，是啊，...', '', '扣儿小姐', '7', '0');
INSERT INTO `film_comment` VALUES ('28395394', '218219', '1434928526', '一场海底世界的探险之旅', '', 'ping_855941704', '0', '0');
INSERT INTO `film_comment` VALUES ('38062955', '218219', '1470199078', '独眼鲨变身小朋友，和小梅莎的父女情非常感人。各种敢想敢拍的剧情，加上恶搞的气氛，作为国产动画，《潜艇总动员》系列的第五部，真心不错。', '天津', '伊儿', '6', '0');
INSERT INTO `film_comment` VALUES ('39573417', '236948', '1476525527', '期待', '', '杨淳开6', '0', '0');
INSERT INTO `film_comment` VALUES ('42191153', '244238', '1493317566', '原创动画，作为同行支持一下！', '揭阳', '甜心Joker', '7', '0');
INSERT INTO `film_comment` VALUES ('42191160', '244238', '1493317715', '带小女朋友去看，永远长不大的宝宝', '醴陵', '历史的遗憾', '7', '0');
INSERT INTO `film_comment` VALUES ('42356990', '244048', '1494946278', '弱智动画片~~', '南宁', '黄色屌丝男', '0', '9');
INSERT INTO `film_comment` VALUES ('42357011', '244238', '1494946312', '你的爸爸是国王？做梦吧你！\n你的爸爸是屌丝！这样才对！', '南宁', '黄色屌丝男', '0', '0');
INSERT INTO `film_comment` VALUES ('42357019', '218413', '1494946338', '我艹你亲娘家的二大爷！', '南宁', '黄色屌丝男', '0', '14');
INSERT INTO `film_comment` VALUES ('42357045', '218219', '1494946457', '盖中盖牌脑残片，一天吃两片！', '南宁', '黄色屌丝男', '1', '3');
INSERT INTO `film_comment` VALUES ('42369706', '236948', '1495078346', '这么热的天走进影院看南极才是正经事1', '北京', '良辰美景', '8', '0');
INSERT INTO `film_comment` VALUES ('42397804', '236948', '1495354846', '期待', '宣城', 'ALIC_阿席达卡', '0', '0');
INSERT INTO `film_comment` VALUES ('42414647', '218413', '1495507498', '又一个被译名毁了的电影。本身素质一般吧，不过不失，想想当年玩这个游戏的我也奔3了，也算一种致青春吧', '梧州', '月光不吹风', '7', '0');
INSERT INTO `film_comment` VALUES ('42436552', '221226', '1495707552', '郑凯一路先前的样子~~~跑男团的确接不少电影', '湛江', 'W-aev', '0', '0');
INSERT INTO `film_comment` VALUES ('42447864', '221226', '1495849686', '烂片的保障，提供给低智商人士观看', '广州', 'emsblack', '1', '0');
INSERT INTO `film_comment` VALUES ('42449314', '40205', '1495861940', '不是说好141分钟，怎么成133了？还我剪掉的8分钟！', '', '超人最怕蝙蝠侠', '10', '3');
INSERT INTO `film_comment` VALUES ('42449515', '40205', '1495864359', '倒计时6天！', '秦皇岛', '进击的队长', '10', '0');
INSERT INTO `film_comment` VALUES ('42450204', '40205', '1495871380', '性感分，看完之后在评价', '广州', 'emsblack', '8', '0');
INSERT INTO `film_comment` VALUES ('42450275', '218413', '1495871869', '此片应该叫《瑞奇与叮当》，是索尼出品的一款游戏。', '伊宁', '阿昆', '0', '1');
INSERT INTO `film_comment` VALUES ('42451485', '232256', '1495882405', '和闺蜜一起看的，好害怕，哈哈哈哈', '', 'M_1612240016034766130', '10', '0');
INSERT INTO `film_comment` VALUES ('42454885', '216008', '1495895868', '格鲁特宝宝实在太可爱了', '上海', 'tree9865', '6', '0');
INSERT INTO `film_comment` VALUES ('42455680', '232256', '1495897185', '夏、19歲の肖像', '昆明', '-Rough', '6', '0');
INSERT INTO `film_comment` VALUES ('42461206', '232256', '1495911265', '好看', '', '时光用户_1485232708651', '10', '0');
INSERT INTO `film_comment` VALUES ('42463117', '216008', '1495919228', 'guangzhou with dad', '广州', 'SweetIsabel', '8', '0');
INSERT INTO `film_comment` VALUES ('42464066', '244048', '1495938284', '打打杀杀的，感觉没有什么教育意义。', '', '伟伟_368949123', '1', '0');
INSERT INTO `film_comment` VALUES ('42464452', '216008', '1495941004', '没有第一部逗', '哈尔滨', 'taoklose', '7', '0');
INSERT INTO `film_comment` VALUES ('42464469', '224149', '1495941111', '越来越无聊了', '哈尔滨', 'taoklose', '7', '0');
INSERT INTO `film_comment` VALUES ('42464780', '224149', '1495944128', '越来越不喜欢范迪塞尔了，感觉这人太自以为是', '南京', '吐槽君矩阵', '7', '0');
INSERT INTO `film_comment` VALUES ('42464952', '231651', '1495945947', '剧情有点牵强，太空人就这样无纪律无组织？', '', '胡？城', '7', '0');
INSERT INTO `film_comment` VALUES ('42466093', '224149', '1495956677', '最喜欢的系列电影，陪他到最后', '', 'ss--东諆 国安～', '10', '0');
INSERT INTO `film_comment` VALUES ('42466300', '231651', '1495958529', '被微博安利。可以说是值得票钱了。看了很难受，结局反转有点揪心_(:з)∠)_', '', '萌十一QAQ', '7', '0');
INSERT INTO `film_comment` VALUES ('42466304', '224894', '1495958538', '撼明易，撼戚家军难', '上虞', '水浒三国金刚', '6', '0');
INSERT INTO `film_comment` VALUES ('42466474', '221226', '1495959822', '郑凯真是一年年烂片不断啊，有些年轻演员真是好不了了……', '海口', '困惑', '0', '0');
INSERT INTO `film_comment` VALUES ('42466688', '224894', '1495961418', '在用心一点点，你就是个好片。', '马达加斯加', 'm2box', '6', '0');
INSERT INTO `film_comment` VALUES ('42466730', '219109', '1495961565', '康永哥试图借用“梦”让该片升华，然而始终是无法摆脱烂片命运的。小制作、无趣、无聊……我之所以坚持要看，纯粹是因为康熙情结，没有人知道我连看到那些通告艺人是何等的激动，仿佛回到康熙的年代。然而，小S的演技着实堪忧，唯有金世佳有那么一点萌！', '成都', '房女', '5', '0');
INSERT INTO `film_comment` VALUES ('42467042', '231651', '1495963595', '21世纪能拍出这种大制作、低智商的片子实属不易，它要能得7分，那《地心引力》肯定会得满分。', '石家庄', 'ggginoicq', '5', '0');
INSERT INTO `film_comment` VALUES ('42467179', '219109', '1495964795', '用心去看 你会看到不一样 电影很多时候 是用心看的', '', 'M_1505242203415418859', '10', '0');
INSERT INTO `film_comment` VALUES ('42467434', '219109', '1495966748', '有些意想不到，但总觉得有些东西都是点到为止，用梦解释一切 稍微有些牵强', '深圳', 'sun792', '7', '0');
INSERT INTO `film_comment` VALUES ('42467588', '232932', '1495967869', '国内什么时候能拍出这种片子？又不需要特效', '', 'M_1603081838549105914', '9', '0');
INSERT INTO `film_comment` VALUES ('42467738', '232932', '1495968512', '还是很不错的励志片，但相对超高的口碑来说，看之前的期望有些过高了，虽然还是有一些感人之处，但总体来说并没有感觉惊艳。', '北京', '第二世', '7', '1');
INSERT INTO `film_comment` VALUES ('42467833', '224894', '1495969667', '这才叫“抗日剧”', '宁波', '残花', '7', '1');
INSERT INTO `film_comment` VALUES ('42467866', '151657', '1495969693', '作为商业片，很不错了。印象最深刻的是星星所指向的那座岛，当太阳升起，岛上一片片忽闪忽闪的，像天上的星空，太美了。由哈维尔·巴登扮演的萨拉查倒是印象蛮深刻的。而德普扮演的角色这次却并不那么深刻。', '重庆', 'rainchristina', '7', '0');
INSERT INTO `film_comment` VALUES ('42467932', '151657', '1495970359', '被黑珍珠重现感动哭了，也被巴博萨的人性光辉感动哭了，恨过他，最后是爱的，这就是父爱吧，你是我的宝贝啊…', '泰安', '时光_陈圆圆', '9', '0');
INSERT INTO `film_comment` VALUES ('42467944', '232932', '1495970288', '热血，感人，完美！', '北京', 'picer', '10', '0');
INSERT INTO `film_comment` VALUES ('42467992', '151657', '1495970882', '比4好看，片尾有彩蛋，看起来下一部特纳和琼斯要回归了', '福州', 'HeyJohnny', '8', '0');

-- ----------------------------
-- Table structure for film_info
-- ----------------------------
DROP TABLE IF EXISTS `film_info`;
CREATE TABLE `film_info` (
  `id` int(11) NOT NULL,
  `length` int(11) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `wantedCount` int(11) DEFAULT NULL,
  `ratingFinal` double DEFAULT NULL,
  `rDay` int(11) DEFAULT NULL,
  `rMonth` int(11) DEFAULT NULL,
  `rYear` int(11) DEFAULT NULL,
  `actorName1` varchar(255) DEFAULT NULL,
  `actorName2` varchar(255) DEFAULT NULL,
  `direcotrName` varchar(255) DEFAULT NULL,
  `commonSpecial` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of film_info
-- ----------------------------
INSERT INTO `film_info` VALUES ('40205', '133', '神奇女侠', '动作 / 冒险 / 奇幻', '5512', '-1', '2', '6', '2017', '盖尔·加朵', '克里斯·派恩', '派蒂·杰金斯', '');
INSERT INTO `film_info` VALUES ('151657', '129', '加勒比海盗5：死无对证', '动作 / 冒险 / 奇幻', '5669', '7.6', '26', '5', '2017', '约翰尼·德普', '哈维尔·巴登', '乔阿吉姆·罗恩尼', '熟悉的卡司配乐引人怀旧');
INSERT INTO `film_info` VALUES ('157836', '95', '摩尔庄园2海妖宝藏', '动画 / 冒险', '592', '6.3', '28', '5', '2017', '黄渤', '季冠霖', '刘可欣', '');
INSERT INTO `film_info` VALUES ('216008', '137', '银河护卫队2', '动作 / 冒险 / 科幻', '2505', '7.9', '5', '5', '2017', '克里斯·帕拉特', '佐伊·索尔达娜', '詹姆斯·古恩', '星爵将逗比进行到底');
INSERT INTO `film_info` VALUES ('218219', '80', '潜艇总动员：时光宝盒', '动画 / 喜剧 / 冒险', '432', '5.6', '28', '5', '2017', '范楚绒', '洪海天', '何子力', '');
INSERT INTO `film_info` VALUES ('218413', '94', '银河守卫队', '动画 / 动作 / 冒险', '81', '-1', '27', '5', '2017', '詹姆斯·阿诺德·泰勒', '大卫·凯耶', '凯文·门罗', '好莱坞小怪兽大闹太空');
INSERT INTO `film_info` VALUES ('219109', '90', '“吃吃”的爱', '喜剧 / 奇幻 / 爱情', '381', '6.5', '27', '5', '2017', '徐熙娣', '林志玲', '蔡康永', '蔡康永导演处女作联手小S');
INSERT INTO `film_info` VALUES ('221226', '93', '临时演员', '喜剧 / 爱情', '1863', '5.5', '27', '5', '2017', '郑恺', '热依扎', '钱江汉', '郑恺热依扎郭晓东复杂三角恋');
INSERT INTO `film_info` VALUES ('224894', '120', '荡寇风云', '动作 / 战争', '373', '6.8', '27', '5', '2017', '赵文卓', '万茜', '陈嘉上', '赵文卓洪金宝万茜抗击倭寇');
INSERT INTO `film_info` VALUES ('231651', '103', '异星觉醒', '恐怖 / 科幻 / 惊悚', '2468', '7.3', '19', '5', '2017', '杰克·吉伦哈尔', '丽贝卡·弗格森', '丹尼尔·伊斯皮诺萨', '外星生物在太空飞船制造幽闭惊悚');
INSERT INTO `film_info` VALUES ('232256', '90', '夏天19岁的肖像', '爱情 / 悬疑', '512', '5.8', '27', '5', '2017', '黄子韬', '杨采钰', '张荣吉', '黄子韬杨采钰上演“窥恋追逃”');
INSERT INTO `film_info` VALUES ('232932', '140', '摔跤吧！爸爸', '喜剧 / 动作 / 家庭', '1477', '8.6', '5', '5', '2017', '阿米尔·汗', '法缇玛·萨那·纱卡', '尼特什·提瓦瑞', '阿米尔汗领衔摔跤娘子军');
INSERT INTO `film_info` VALUES ('236948', '101', '哆啦A梦：大雄的南极冰冰凉大冒险', '动画', '475', '-1', '30', '5', '2017', '水田山葵', '大原惠美', '高桥敦史', '');
INSERT INTO `film_info` VALUES ('244048', '80', '三只小猪2', '动画 / 家庭 / 儿童', '75', '-1', '27', '5', '2017', '王晓彤', '李晔', '刘炜', '正义小猪踏上冒险新征程');
INSERT INTO `film_info` VALUES ('244238', '84', '我的爸爸是国王', '动画 / 喜剧', '365', '-1', '27', '5', '2017', '吕豆', '禹祥', '刘俊', '国王老爸与公主女儿一起冒险');
